OpenFOAM/2.2.x/ERCOFTAC-SIG15/case13.1/steadyState/alpha_0/share/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            mappedPatch;
        nFaces          20;
        startFace       14349;
        sampleMode      nearestCell;
        sampleRegion    region0;
        samplePatch     none;
        offsetMode      uniform;
        offset          (-0.0624999 0 0);
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       14369;
    }
    slip
    {
        type            patch;
        nFaces          10;
        startFace       14519;
    }
    rotaingWall
    {
        type            wall;
        nFaces          71;
        startFace       14529;
    }
    inletWall
    {
        type            wall;
        nFaces          41;
        startFace       14600;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7270;
        startFace       14641;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          7270;
        startFace       21911;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       29181;
    }
)

// ************************************************************************* //
