OpenFOAM/2.2.x/ERCOFTAC-SIG15/case13.1/steadyState/alpha_0/share/Allrun.post
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication foamLog log.$(getApplication)

if [ "x$1" = "x-parallel" -o "x$1" = "x-p" ]
then
    runParallel sample $(getNumberOfProcessors) -latestTime
    runParallel yPlusRAS $(getNumberOfProcessors) -latestTime
else
    runApplication sample -latestTime
    runApplication yPlusRAS -latestTime
fi

for dir in plot validation
do
    if [ -d $dir ];then
	(cd $dir
	    ./Allrun.post
	    )
    fi
done

