OpenFOAM/2.2.x/ERCOFTAC-SIG15/case13.1/steadyState/alpha_0/share/Allrun.solve
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

if [ "x$1" = "x-parallel" -o "x$1" = "x-p" ]
then
    runApplication decomposePar
    runParallel $(getApplication) $(getNumberOfProcessors)
    runApplication reconstructPar -latestTime
else
    runApplication $(getApplication)
fi

